In [1]:
import psycopg2
import pandas as pd
import config as cfg
from sqlalchemy import create_engine

In [2]:
#Data buckets for source of wealth and education

sow_billionaire_id_container = []
sow_container                = []
education_billionaire_id_container = []
education_container = []

In [3]:
# Read the billionaire data

billionaire_metadata  = pd.read_csv(cfg.forbes_billionaire_csv_path)
bronze_billionaire_df = pd.DataFrame(billionaire_metadata) 
bronze_billionaire_df.head(2) #table is already sorted by net-worth

,Name,NetWorth,Country,Source,Rank,Age,Residence,Citizenship,Status,Children,Education,Self_made,geometry
0,Jeff Bezos,177.0,United States,Amazon,1,57.0,"Seattle, Washington",United States,In Relationship,4.0,"Bachelor of Arts/Science, Princeton University",True,POINT (-122.3300624 47.6038321)
1,Elon Musk,151.0,United States,"Tesla, SpaceX",2,49.0,"Austin, Texas",United States,In Relationship,7.0,"Bachelor of Arts/Science, University of Pennsy...",True,POINT (-97.74369950000001 30.2711286)

In [4]:
bronze_billionaire_df.isnull().sum()

Name              0
NetWorth          0
Country           0
Source            0
Rank              0
Age             125
Residence        40
Citizenship      16
Status          665
Children       1203
Education      1346
Self_made        18
geometry          0
dtype: int64

In [5]:
#lower case all column names for postgreSQL
#Source: https://cmdlinetips.com/2020/07/cleaning_up_pandas-column-names/

bronze_billionaire_df.rename(columns=str.lower,inplace=True)

In [6]:
#persist the raw-unmodified data to the database

password="postgres"
engine = create_engine(f'postgresql://postgres:{password}@localhost:5432/Billionaire')
connection = engine.connect()
bronze_billionaire_df.to_sql(name='bronze_billionaire', con=engine, if_exists='replace', index=False)

In [7]:
#Clone to bronze table to proceed with work on the silver version of the data

silver_billionaire_df = bronze_billionaire_df[:102].copy()
print(silver_billionaire_df.count())

name           102
networth       102
country        102
source         102
rank           102
age            101
residence      102
citizenship    102
status          88
children        73
education       73
self_made      102
geometry       102
dtype: int64

In [8]:
#Rename columns
silver_billionaire_df.rename(columns={"name"      : "display_name", 
                                      "source"    : "source_of_wealth",
                                      "rank"      : "wealth_rank",
                                      "status"    : "relationship_status",
                                      "self_Made" : "is_self_made",
                                      "networth"  : "net_worth",
                                      "self_made" : "is_self_made",
                                      "geometry"  : "geometry"}, inplace=True)
silver_billionaire_df.head(2)

,display_name,net_worth,country,source_of_wealth,wealth_rank,age,residence,citizenship,relationship_status,children,education,is_self_made,geometry
0,Jeff Bezos,177.0,United States,Amazon,1,57.0,"Seattle, Washington",United States,In Relationship,4.0,"Bachelor of Arts/Science, Princeton University",True,POINT (-122.3300624 47.6038321)
1,Elon Musk,151.0,United States,"Tesla, SpaceX",2,49.0,"Austin, Texas",United States,In Relationship,7.0,"Bachelor of Arts/Science, University of Pennsy...",True,POINT (-97.74369950000001 30.2711286)

In [9]:
#Clean the Name column and remove reference for "& family" and "family"
#Source: https://stackoverflow.com/questions/37593550/replace-method-not-working-on-pandas-dataframe

silver_billionaire_df["display_name"].replace({"& family": '', "family": ''}, inplace=True, regex=True)
silver_billionaire_df["display_name"] = silver_billionaire_df["display_name"].str.strip()
silver_billionaire_df.head(2)

,display_name,net_worth,country,source_of_wealth,wealth_rank,age,residence,citizenship,relationship_status,children,education,is_self_made,geometry
0,Jeff Bezos,177.0,United States,Amazon,1,57.0,"Seattle, Washington",United States,In Relationship,4.0,"Bachelor of Arts/Science, Princeton University",True,POINT (-122.3300624 47.6038321)
1,Elon Musk,151.0,United States,"Tesla, SpaceX",2,49.0,"Austin, Texas",United States,In Relationship,7.0,"Bachelor of Arts/Science, University of Pennsy...",True,POINT (-97.74369950000001 30.2711286)

In [10]:
#Create new columns for first name, middle name, and last name
df1 = pd.DataFrame(columns=['first_name','middle_name','last_Name','suffix'])
silver_billionaire_df = silver_billionaire_df.join(df1, how="outer")

In [11]:
#Explode the name column to populate first name, middle name, last name, and suffix where appropriate

for (idx, data_row) in silver_billionaire_df.iterrows():
    
    name_parts = data_row["display_name"].split()
        
    if len(name_parts) == 2:
        
        silver_billionaire_df.at[idx,'first_name'] = name_parts[0]
        silver_billionaire_df.at[idx,'last_name']  = name_parts[1]       

    elif len(name_parts) == 3:
        
        silver_billionaire_df.at[idx,'first_name']  = name_parts[0]
        
        if "," in name_parts[1]:
            
            cleaned_name = name_parts[1].replace(",",'')
            suffix = name_parts[2]
            
            silver_billionaire_df.at[idx,'first_name'] = name_parts[0]
            silver_billionaire_df.at[idx,'last_name']  = cleaned_name
            silver_billionaire_df.at[idx,'suffix']     = suffix         
            
        else:
            silver_billionaire_df.at[idx,'first_name']  = name_parts[0]
            silver_billionaire_df.at[idx,'middle_name'] = name_parts[1]
            silver_billionaire_df.at[idx,'last_name']   = name_parts[2] 
            
    elif len(name_parts) == 4:
        
        silver_billionaire_df.at[idx,'first_name'] = name_parts[0]
        silver_billionaire_df.at[idx,'last_name']  = name_parts[3]

In [12]:
#Create new columns for longitude and latitude
df1 = pd.DataFrame(columns=['city_of_residence','state_of_residence'])
silver_billionaire_df = silver_billionaire_df.join(df1, how="outer")

In [13]:
for (idx, data_row) in silver_billionaire_df.iterrows():
    
    if pd.notnull(data_row['residence']):
        
        residence_parts = data_row['residence'].split(',')
        city  = residence_parts[0]
        silver_billionaire_df.at[idx,'city_of_residence'] = city
        
        if pd.notnull(data_row['country']) and data_row["country"] == 'United States' and pd.notnull(data_row['citizenship']) and data_row["citizenship"] == 'United States':
        
            state = residence_parts[1]
            silver_billionaire_df.at[idx,'state_of_residence'] = state.strip()

In [14]:
#Create new columns for longitude and latitude
df1 = pd.DataFrame(columns=['longitude','latitude'])
silver_billionaire_df = silver_billionaire_df.join(df1, how="outer")

In [15]:
#Pull out latitude and longitude from geometry column to aide future accessibility to those values

for (idx, data_row) in silver_billionaire_df.iterrows():

    point_parts = data_row["geometry"].split(" ")

    longitude = str(point_parts[1]).replace("(",'') #longitude
    latitude  = str(point_parts[2]).replace(")",'') #latitude
    
    silver_billionaire_df.at[idx,'longitude'] = longitude
    silver_billionaire_df.at[idx,'latitude']  = latitude

In [16]:
silver_billionaire_df.head(2)

,display_name,net_worth,country,source_of_wealth,wealth_rank,age,residence,citizenship,relationship_status,children,...,geometry,first_name,middle_name,last_Name,suffix,last_name,city_of_residence,state_of_residence,longitude,latitude
0,Jeff Bezos,177.0,United States,Amazon,1,57.0,"Seattle, Washington",United States,In Relationship,4.0,...,POINT (-122.3300624 47.6038321),Jeff,NaN,NaN,NaN,Bezos,Seattle,Washington,-122.3300624,47.6038321
1,Elon Musk,151.0,United States,"Tesla, SpaceX",2,49.0,"Austin, Texas",United States,In Relationship,7.0,...,POINT (-97.74369950000001 30.2711286),Elon,NaN,NaN,NaN,Musk,Austin,Texas,-97.74369950000001,30.2711286

In [17]:
dupes_df = silver_billionaire_df.groupby('display_name').filter(lambda x: len(x) > 1).sort_values(by=['display_name'])
display(dupes_df)

Empty DataFrame
Columns: [display_name, net_worth, country, source_of_wealth, wealth_rank, age, residence, citizenship, relationship_status, children, education, is_self_made, geometry, first_name, middle_name, last_Name, suffix, last_name, city_of_residence, state_of_residence, longitude, latitude]
Index: []

[0 rows x 22 columns]

In [18]:
# Remove all duplicated records by display name by filtering them out

dupes_df = pd.DataFrame(silver_billionaire_df.groupby('display_name').size().loc[lambda x: x>1].reset_index())
dupes_list = dupes_df["display_name"]
silver_billionaire_df = silver_billionaire_df.loc[~silver_billionaire_df["display_name"].isin(dupes_list)]

In [19]:
# Filter out records that contain 'and'

and_df = silver_billionaire_df.loc[silver_billionaire_df["display_name"].str.contains("and") | silver_billionaire_df["display_name"].str.contains("&")]
and_list = dupes_list = and_df["display_name"]
silver_billionaire_df = silver_billionaire_df.loc[~silver_billionaire_df["display_name"].isin(and_list)]

In [20]:
#lower case all column names for postgreSQL
#Source: https://cmdlinetips.com/2020/07/cleaning_up_pandas-column-names/

silver_billionaire_df.rename(columns=str.lower,inplace=True)

In [21]:
#Populate education history and source of wealth tablews

for (idx, data_row) in silver_billionaire_df.iterrows():

    if pd.notnull(data_row["source_of_wealth"]):
        sources_of_wealth = data_row["source_of_wealth"].split(',')
        
        for source in sources_of_wealth:
            sow_billionaire_id_container.append(idx)
            sow_container.append(source.strip().title())

    if pd.notnull(data_row["education"]):
        education_history = data_row["education"].split(';')
        
        for education in education_history:
            education_billionaire_id_container.append(idx)
            education_container.append(education.strip().title())

In [22]:
#Remove education and source of wealth columns as they've been normalized into their own tables

silver_billionaire_df.drop(['source_of_wealth', 'education'], axis=1, inplace=True)

In [23]:
#Set the index of the silver DataFrame

#Source: https://stackoverflow.com/questions/19851005/rename-pandas-dataframe-index
silver_billionaire_df.index.names = ['billionaire_id']

In [24]:
#Write silver table to postgreSQL

password="postgres"
engine = create_engine(f'postgresql://postgres:{password}@localhost:5432/Billionaire')
connection = engine.connect()
silver_billionaire_df.to_sql(name='silver_billionaire', con=engine, if_exists='append',index=True)

In [25]:
#Save silver table to CSV for use in API notebook

silver_billionaire_df.to_csv(f"{cfg.silver_billionaire_csv_path}",header=True,index=True)

In [26]:
# Build DataFrames from sources of wealth and education containers

source_of_wealth_df = pd.DataFrame({'billionaire_id' : sow_billionaire_id_container,
                                    'wealth_source'  : sow_container})

education_history_df = pd.DataFrame({'billionaire_id' : education_billionaire_id_container,
                                    'education'       : education_container})

In [27]:
#Write source of wealth table to postgreSQL

password="postgres"
engine = create_engine(f'postgresql://postgres:{password}@localhost:5432/Billionaire')
connection = engine.connect()
source_of_wealth_df.to_sql(name='source_of_wealth', con=engine, if_exists='append',index=False)

In [28]:
#Write education history to postgreSQL

password="postgres"
engine = create_engine(f'postgresql://postgres:{password}@localhost:5432/Billionaire')
connection = engine.connect()
education_history_df.to_sql(name='education_history', con=engine, if_exists='append',index=False)

In [29]:
#Save education history and source of wealth DataFrames to CSV

source_of_wealth_df.to_csv(f"{cfg.source_of_wealth_csv_path}",header=True,index=False)
education_history_df.to_csv(f"{cfg.education_history_csv_path}",header=True,index=False)